testTesults/stage_5/5_range_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 6.029ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 206.989ms, rate sampling interval: 572ms
  Thread calibration: mean lat.: 159.114ms, rate sampling interval: 426ms
  Thread calibration: mean lat.: 5.808ms, rate sampling interval: 23ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    56.94ms   80.37ms 322.82ms   80.96%
    Req/Sec   255.31     67.39   583.00     71.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.97ms
 75.000%  103.55ms
 90.000%  180.48ms
 99.000%  301.82ms
 99.900%  318.72ms
 99.990%  321.79ms
 99.999%  323.07ms
100.000%  323.07ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.117     0.000000            1         1.00
       1.408     0.100000         2008         1.11
       3.061     0.200000         4016         1.25
       4.871     0.300000         6026         1.43
       7.231     0.400000         8029         1.67
      11.967     0.500000        10032         2.00
      16.295     0.550000        11036         2.22
      22.687     0.600000        12040         2.50
      30.879     0.650000        13043         2.86
      50.527     0.700000        14046         3.33
     103.551     0.750000        15051         4.00
     118.271     0.775000        15553         4.44
     132.223     0.800000        16053         5.00
     146.687     0.825000        16555         5.71
     159.871     0.850000        17056         6.67
     169.855     0.875000        17565         8.00
     174.463     0.887500        17812         8.89
     180.479     0.900000        18058        10.00
     187.391     0.912500        18318        11.43
     193.151     0.925000        18563        13.33
     205.311     0.937500        18810        16.00
     214.655     0.943750        18936        17.78
     237.951     0.950000        19061        20.00
     253.311     0.956250        19187        22.86
     264.703     0.962500        19312        26.67
     280.063     0.968750        19440        32.00
     283.903     0.971875        19506        35.56
     286.207     0.975000        19565        40.00
     288.767     0.978125        19632        45.71
     291.327     0.981250        19693        53.33
     294.143     0.984375        19755        64.00
     295.935     0.985938        19786        71.11
     297.983     0.987500        19815        80.00
     300.543     0.989062        19849        91.43
     303.615     0.990625        19876       106.67
     306.175     0.992188        19910       128.00
     307.199     0.992969        19923       142.22
     308.223     0.993750        19940       160.00
     309.247     0.994531        19956       182.86
     310.783     0.995313        19971       213.33
     312.063     0.996094        19986       256.00
     312.831     0.996484        19995       284.44
     313.343     0.996875        20003       320.00
     314.623     0.997266        20010       365.71
     315.135     0.997656        20020       426.67
     316.159     0.998047        20025       512.00
     316.671     0.998242        20029       568.89
     317.183     0.998437        20034       640.00
     317.695     0.998633        20038       731.43
     318.207     0.998828        20042       853.33
     318.719     0.999023        20045      1024.00
     319.231     0.999121        20048      1137.78
     319.487     0.999219        20049      1280.00
     319.999     0.999316        20053      1462.86
     319.999     0.999414        20053      1706.67
     320.511     0.999512        20056      2048.00
     320.511     0.999561        20056      2275.56
     321.023     0.999609        20059      2560.00
     321.023     0.999658        20059      2925.71
     321.023     0.999707        20059      3413.33
     321.535     0.999756        20061      4096.00
     321.535     0.999780        20061      4551.11
     321.535     0.999805        20061      5120.00
     321.535     0.999829        20061      5851.43
     321.791     0.999854        20062      6826.67
     321.791     0.999878        20062      8192.00
     321.791     0.999890        20062      9102.22
     322.303     0.999902        20063     10240.00
     322.303     0.999915        20063     11702.86
     322.303     0.999927        20063     13653.33
     322.303     0.999939        20063     16384.00
     322.303     0.999945        20063     18204.44
     323.071     0.999951        20064     20480.00
     323.071     1.000000        20064          inf
#[Mean    =       56.943, StdDeviation   =       80.374]
#[Max     =      322.816, Total count    =        20064]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29993 requests in 30.00s, 1.49MB read
Requests/sec:    999.66
Transfer/sec:     50.76KB
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 162.946ms, rate sampling interval: 520ms
  Thread calibration: mean lat.: 275.127ms, rate sampling interval: 787ms
  Thread calibration: mean lat.: 7.068ms, rate sampling interval: 29ms
  Thread calibration: mean lat.: 6.596ms, rate sampling interval: 29ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    55.75ms   86.35ms 377.09ms   83.61%
    Req/Sec   253.86     54.18   464.00     70.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.26ms
 75.000%   56.32ms
 90.000%  204.54ms
 99.000%  341.76ms
 99.900%  368.89ms
 99.990%  375.55ms
 99.999%  377.34ms
100.000%  377.34ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.143     0.000000            1         1.00
       1.469     0.100000         2008         1.11
       3.081     0.200000         4015         1.25
       5.031     0.300000         6024         1.43
       7.583     0.400000         8029         1.67
      12.255     0.500000        10037         2.00
      16.119     0.550000        11042         2.22
      20.703     0.600000        12046         2.50
      27.759     0.650000        13047         2.86
      40.895     0.700000        14051         3.33
      56.319     0.750000        15054         4.00
      73.535     0.775000        15556         4.44
     104.191     0.800000        16058         5.00
     130.687     0.825000        16560         5.71
     165.631     0.850000        17063         6.67
     185.087     0.875000        17563         8.00
     193.279     0.887500        17814         8.89
     204.543     0.900000        18066        10.00
     212.735     0.912500        18316        11.43
     224.639     0.925000        18568        13.33
     241.663     0.937500        18820        16.00
     248.703     0.943750        18945        17.78
     260.223     0.950000        19069        20.00
     272.895     0.956250        19195        22.86
     287.743     0.962500        19324        26.67
     296.447     0.968750        19450        32.00
     299.775     0.971875        19509        35.56
     303.359     0.975000        19571        40.00
     306.687     0.978125        19634        45.71
     311.039     0.981250        19704        53.33
     315.903     0.984375        19759        64.00
     320.511     0.985938        19792        71.11
     325.119     0.987500        19822        80.00
     335.615     0.989062        19853        91.43
     344.831     0.990625        19886       106.67
     348.415     0.992188        19917       128.00
     350.463     0.992969        19931       142.22
     352.767     0.993750        19949       160.00
     355.071     0.994531        19963       182.86
     357.119     0.995313        19980       213.33
     358.655     0.996094        19994       256.00
     359.935     0.996484        20002       284.44
     361.471     0.996875        20010       320.00
     363.007     0.997266        20018       365.71
     364.031     0.997656        20026       426.67
     365.055     0.998047        20033       512.00
     365.567     0.998242        20037       568.89
     366.847     0.998437        20042       640.00
     367.871     0.998633        20046       731.43
     368.639     0.998828        20049       853.33
     369.151     0.999023        20053      1024.00
     369.663     0.999121        20055      1137.78
     370.175     0.999219        20057      1280.00
     370.687     0.999316        20060      1462.86
     371.199     0.999414        20061      1706.67
     373.247     0.999512        20063      2048.00
     373.503     0.999561        20064      2275.56
     373.759     0.999609        20065      2560.00
     374.271     0.999658        20066      2925.71
     375.039     0.999707        20067      3413.33
     375.295     0.999756        20069      4096.00
     375.295     0.999780        20069      4551.11
     375.295     0.999805        20069      5120.00
     375.295     0.999829        20069      5851.43
     375.551     0.999854        20070      6826.67
     375.551     0.999878        20070      8192.00
     375.551     0.999890        20070      9102.22
     376.831     0.999902        20071     10240.00
     376.831     0.999915        20071     11702.86
     376.831     0.999927        20071     13653.33
     376.831     0.999939        20071     16384.00
     376.831     0.999945        20071     18204.44
     377.343     0.999951        20072     20480.00
     377.343     1.000000        20072          inf
#[Mean    =       55.749, StdDeviation   =       86.346]
#[Max     =      377.088, Total count    =        20072]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30001 requests in 30.01s, 1.49MB read
Requests/sec:    999.57
Transfer/sec:     50.76KB
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 338.392ms, rate sampling interval: 1576ms
  Thread calibration: mean lat.: 627.970ms, rate sampling interval: 2357ms
  Thread calibration: mean lat.: 512.611ms, rate sampling interval: 2134ms
  Thread calibration: mean lat.: 559.146ms, rate sampling interval: 1905ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   546.74ms  804.85ms   2.39s    75.69%
    Req/Sec   266.82     76.41   509.00     82.05%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.46ms
 75.000%    1.29s 
 90.000%    1.95s 
 99.000%    2.30s 
 99.900%    2.37s 
 99.990%    2.39s 
 99.999%    2.39s 
100.000%    2.39s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.129     0.000000            1         1.00
       1.570     0.100000         2134         1.11
       3.623     0.200000         4265         1.25
       5.863     0.300000         6401         1.43
       8.847     0.400000         8528         1.67
      13.463     0.500000        10658         2.00
      17.327     0.550000        11728         2.22
      25.039     0.600000        12790         2.50
     194.815     0.650000        13856         2.86
     765.951     0.700000        14922         3.33
    1289.215     0.750000        15990         4.00
    1448.959     0.775000        16525         4.44
    1576.959     0.800000        17053         5.00
    1710.079     0.825000        17590         5.71
    1779.711     0.850000        18125         6.67
    1867.775     0.875000        18656         8.00
    1903.615     0.887500        18920         8.89
    1954.815     0.900000        19185        10.00
    1989.631     0.912500        19461        11.43
    2044.927     0.925000        19723        13.33
    2076.671     0.937500        19986        16.00
    2088.959     0.943750        20120        17.78
    2107.391     0.950000        20259        20.00
    2136.063     0.956250        20384        22.86
    2179.071     0.962500        20521        26.67
    2203.647     0.968750        20656        32.00
    2215.935     0.971875        20717        35.56
    2224.127     0.975000        20784        40.00
    2236.415     0.978125        20857        45.71
    2248.703     0.981250        20918        53.33
    2271.231     0.984375        20987        64.00
    2279.423     0.985938        21020        71.11
    2283.519     0.987500        21051        80.00
    2289.663     0.989062        21087        91.43
    2299.903     0.990625        21117       106.67
    2320.383     0.992188        21154       128.00
    2322.431     0.992969        21168       142.22
    2326.527     0.993750        21191       160.00
    2328.575     0.994531        21204       182.86
    2330.623     0.995313        21217       213.33
    2351.103     0.996094        21233       256.00
    2357.247     0.996484        21244       284.44
    2359.295     0.996875        21251       320.00
    2361.343     0.997266        21261       365.71
    2365.439     0.997656        21277       426.67
    2365.439     0.998047        21277       512.00
    2367.487     0.998242        21281       568.89
    2369.535     0.998437        21287       640.00
    2369.535     0.998633        21287       731.43
    2373.631     0.998828        21297       853.33
    2373.631     0.999023        21297      1024.00
    2375.679     0.999121        21302      1137.78
    2375.679     0.999219        21302      1280.00
    2375.679     0.999316        21302      1462.86
    2377.727     0.999414        21304      1706.67
    2379.775     0.999512        21307      2048.00
    2379.775     0.999561        21307      2275.56
    2381.823     0.999609        21309      2560.00
    2381.823     0.999658        21309      2925.71
    2383.871     0.999707        21310      3413.33
    2385.919     0.999756        21312      4096.00
    2385.919     0.999780        21312      4551.11
    2385.919     0.999805        21312      5120.00
    2387.967     0.999829        21314      5851.43
    2387.967     0.999854        21314      6826.67
    2387.967     0.999878        21314      8192.00
    2387.967     0.999890        21314      9102.22
    2387.967     0.999902        21314     10240.00
    2390.015     0.999915        21316     11702.86
    2390.015     1.000000        21316          inf
#[Mean    =      546.745, StdDeviation   =      804.853]
#[Max     =     2387.968, Total count    =        21316]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29996 requests in 30.00s, 1.79MB read
Requests/sec:    999.81
Transfer/sec:     60.98KB